{
  "editions": [
    {
      "id": "2025-12",
      "version": "Vol 1 (2025 Dec)",
      "releaseDate": "2025-12-01T00:00:00Z",
      "description": "Kristian Garza's technology radar edition showcasing the current state of technologies and practices.",
      "blips": [
        {
          "id": "blip-fastapi",
          "name": "FastAPI",
          "quadrant": "Languages & Frameworks",
          "ring": "Adopt",
          "description": "Asynchronous Python framework that has reshaped not just how I work but how I think about API development itself. Perhaps the best framework at the moment for production APIs that need elegant concurrent request handling.",
          "isNew": true,
          "movement": "moved_in",
          "links": ["https://fastapi.tiangolo.com"],
          "tags": ["python", "api", "async", "production"]
        },
        {
          "id": "blip-langchain",
          "name": "Langchain",
          "quadrant": "Languages & Frameworks",
          "ring": "Trial",
          "description": "Framework for accessing LLMs that many dismiss as unnecessary abstraction, yet proves useful—critically so—when products require flexibility to move between models. The abstraction, criticized though it may be, proves light enough to justify its existence.",
          "isNew": true,
          "movement": "moved_in",
          "links": ["https://www.langchain.com"],
          "tags": ["llm", "ai", "framework", "abstraction"]
        },
        {
          "id": "blip-llamaindex",
          "name": "LlamaIndex",
          "quadrant": "Languages & Frameworks",
          "ring": "Trial",
          "description": "RAG application framework demonstrating decent utility—not exceptional, but reliable—for both small experimental projects and medium-sized production services. Occupies that productive middle ground between proof-of-concept and enterprise-scale.",
          "isNew": true,
          "movement": "moved_in",
          "links": ["https://www.llamaindex.ai"],
          "tags": ["rag", "ai", "llm", "retrieval"]
        },
        {
          "id": "blip-claude-code",
          "name": "Claude Code",
          "quadrant": "Tools",
          "ring": "Adopt",
          "description": "Marketed as a coding agent but actually a general-purpose agent whose features proliferate beyond easy summarization. The skills feature and context engineering approach are fantastic—so much so that everyone seems to be copying it now.",
          "isNew": true,
          "movement": "moved_in",
          "links": ["https://claude.ai/code"],
          "tags": ["ai", "agent", "coding", "context-engineering"]
        },
        {
          "id": "blip-context7",
          "name": "Context7",
          "quadrant": "Tools",
          "ring": "Adopt",
          "description": "Embodies those rare concepts that benefit everyone if everyone participates. Places documentation in LLM-accessible formats via MCPs, creating a virtuous cycle of accessibility. An essential tool that improves the entire ecosystem.",
          "isNew": true,
          "movement": "moved_in",
          "links": ["https://context7.com"],
          "tags": ["documentation", "mcp", "llm", "accessibility"]
        },
        {
          "id": "blip-ux-pilot",
          "name": "UX Pilot",
          "quadrant": "Tools",
          "ring": "Trial",
          "description": "Used alongside designers to rapidly mock up interfaces with surprisingly smooth translation into Figma and development. My relationship with the tool remains more hopeful than established, more anticipatory than definitive.",
          "isNew": true,
          "movement": "moved_in",
          "links": [],
          "tags": ["design", "mockup", "ai", "prototyping"]
        },
        {
          "id": "blip-figma-playwright-mcps",
          "name": "Figma and Playwright MCPs for Frontend Development",
          "quadrant": "Techniques",
          "ring": "Adopt",
          "description": "A paradigm shift in the design-to-development pipeline. You forget immediately about traditional difficulties of translating Figma designs into functional code. Enables developers to move deeper into design while designers engage more directly with development realities.",
          "isNew": true,
          "movement": "moved_in",
          "links": [],
          "tags": ["frontend", "design-to-code", "mcp", "workflow"]
        },
        {
          "id": "blip-agents-md",
          "name": "AGENTS.md",
          "quadrant": "Techniques",
          "ring": "Adopt",
          "description": "Specification for normalized instructions for coding and databases—a vital, perhaps overdue effort to standardize what was becoming chaotic. Actively transforming repositories to this format, discovering clarity I hadn't realized was missing.",
          "isNew": true,
          "movement": "moved_in",
          "links": ["https://agents.md"],
          "tags": [
            "standardization",
            "agents",
            "context-engineering",
            "specification"
          ]
        },
        {
          "id": "blip-mcp-platform",
          "name": "Model Context Protocol (MCP)",
          "quadrant": "Platforms",
          "ring": "Adopt",
          "description": "Method for accessing data rather than relying directly on APIs. I find myself genuinely torn—witnessing useful proliferation of tooling while encountering disadvantages needing resolution. Still, remains one of the primary solutions for making tools accessible to agents.",
          "isNew": true,
          "movement": "moved_in",
          "links": ["https://modelcontextprotocol.io"],
          "tags": ["protocol", "interoperability", "agents", "data-access"]
        },
        {
          "id": "blip-github-actions-extended",
          "name": "GitHub Actions for Event-Driven Architecture",
          "quadrant": "Platforms",
          "ring": "Adopt",
          "description": "GitHub Actions is not new—I have been using it for years in the traditional sense, for CI/CD workflows, the sort of automation that everyone expects—but nowadays I find myself using it mostly, almost exclusively even, to integrate services and orchestrate event-driven architectures, which has been, I must say without exaggeration, incredible. It has helped me create many services that I was previously considering less seriously, or perhaps not considering at all, services that now feel not just possible but inevitable.",
          "isNew": false,
          "movement": "no_change",
          "links": [
            "https://github.com/features/actions",
            "https://docs.github.com/actions"
          ],
          "tags": [
            "ci-cd",
            "automation",
            "event-driven",
            "integration",
            "workflows"
          ]
        },
        {
          "id": "blip-eleventy",
          "name": "Eleventy (11ty)",
          "quadrant": "Languages & Frameworks",
          "ring": "Adopt",
          "description": "A framework for static websites, though mentioning only this framework seems reductive when what I'm really gesturing toward is that static site generators in general are proving remarkably useful now that we can spin up new apps so quickly, almost thoughtlessly. I have been using 11ty across five small websites and apps that take advantage of JSON as database and local storage together with the really quick—genuinely quick, not just marketing-quick—performance of an 11ty application.",
          "isNew": true,
          "movement": "moved_in",
          "links": ["https://www.11ty.dev", "https://www.11ty.dev/docs"],
          "tags": ["static-site", "jamstack", "performance", "minimal"]
        },
        {
          "id": "blip-bun",
          "name": "Bun",
          "quadrant": "Tools",
          "ring": "Adopt",
          "description": "Recently acquired by Anthropic—and this acquisition feels significant in ways I'm still processing—Bun is one of those executors that has been moving toward something incredibly fast, almost impossibly fast. It has definitely been something I've been using to replace many of my old projects, a migration that feels less like choice and more like necessity, the kind of technical evolution that makes previous approaches feel suddenly, inexplicably obsolete.",
          "isNew": false,
          "movement": "moved_in",
          "previousRing": "Assess",
          "links": ["https://bun.sh", "https://bun.sh/docs"],
          "tags": ["runtime", "javascript", "performance", "tooling"]
        },
        {
          "id": "blip-dia-browser",
          "name": "Dia",
          "quadrant": "Tools",
          "ring": "Assess",
          "description": "A browser I have been trying—genuinely trying, with real effort—to use, but I haven't been successful, cannot escape how good Arc Browser is in comparison, how Arc has shaped my expectations of what browsing should feel like. Still, once they migrate all functionality from Arc to Dia (and surely they will, eventually, perhaps inevitably), I probably will switch, but not at the moment, not yet, not while Arc remains what it is.",
          "isNew": false,
          "movement": "moved_out",
          "previousRing": "Trial",
          "links": ["https://diabrowser.com"],
          "tags": ["browser", "ai", "productivity"]
        },
        {
          "id": "blip-chatgpt-atlas",
          "name": "ChatGPT Atlas",
          "quadrant": "Tools",
          "ring": "Assess",
          "description": "The path I was hoping every browser would follow—exactly what I was thinking in terms of browsing, the sort of thing I have been discussing, sometimes arguing, occasionally banging my head against walls with colleagues about for months now. The problem, the persistent problem, is that it's still incredibly slow, and I think there's space—real, substantial space—for someone else to come in and do this properly. Not a replacement for my browser experience but definitely valuable for specific workflows.",
          "isNew": false,
          "movement": "no_change",
          "links": ["https://openai.com/chatgpt", "https://chatgpt.com"],
          "tags": ["ai", "browsing", "authentication", "integration"]
        },
        {
          "id": "blip-claude-chrome",
          "name": "Claude for Chrome",
          "quadrant": "Tools",
          "ring": "Trial",
          "description": "Without doubt—and I use this phrase deliberately because I have no doubts whatsoever—probably the best experience of an agentic browser that exists right now. Incredibly fast, doing everything you expect it to do and then some. My use has been limited so far, I haven't yet integrated MCPs or connected it with Claude Code, but I can see it integrating with many of the other things I've been doing, becoming part of an incredibly powerful workflow. I'm envious, genuinely envious, of how this came out and we didn't produce something like this before.",
          "isNew": true,
          "movement": "moved_in",
          "links": ["https://chrome.google.com/webstore"],
          "tags": ["browser-extension", "ai", "agent", "productivity", "chrome"]
        },
        {
          "id": "blip-github-copilot",
          "name": "GitHub Copilot",
          "quadrant": "Tools",
          "ring": "Trial",
          "description": "Another coding agent similar to Claude Code—I have been using it for months, and it's been good overall, though 'good overall' is perhaps damning with faint praise. More specifically focused on development than Claude Code, which may be limitation or feature depending on your needs. I complain, perhaps too much, about the default prompts—I don't like the planning prompt at all and have to define my own. It has been falling behind in features: skills isn't there, agents isn't there, capabilities still coming. I'm definitely switching from Copilot to Claude Code, a migration that feels less like abandonment and more like natural progression.",
          "isNew": false,
          "movement": "moved_out",
          "previousRing": "Adopt",
          "links": [
            "https://github.com/features/copilot",
            "https://docs.github.com/copilot"
          ],
          "tags": ["ai", "code-assistant", "productivity"]
        }
      ]
    }
  ]
}
